brew "bat"
brew "ccache"
brew "checkbashisms"
brew "clang-format"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "go"
brew "mas"
brew "neovim"
brew "python"
brew "rename"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "ugrep"
brew "uv"
brew "yt-dlp"

cask "appcleaner"
cask "calibre"
cask "fastmail"
cask "font-cascadia-code-nf"
cask "ghostty"
cask "logitech-g-hub"
cask "obsidian"
cask "scroll-reverser"
cask "signal"
cask "syncthing-app"
cask "tidal"
cask "vlc"
cask "zed"
cask "zen"

mas "Bitwarden", id: 1352778147
mas "WhatsApp", id: 310633997
mas "Yubico Authenticator", id: 1497506650
